src/cf/maERP_ib/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/cf/maERP_ib/src/ChartsOfAccounts/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Хозрасчетный</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоХозрасчетные</extDimensionTypes>
  <predefined>
    <items>
      <name>CLASSE_0</name>
      <description>CLASSE 0 : COMPTES SPECIAUX</description>
      <code>000000</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>CLASSE_1</name>
      <description>CLASSE 1 : COMPTES DE FINANCEMENT PERMANENT</description>
      <code>100000</code>
      <childItems>
        <name>CapitauxPropres</name>
        <description>Capitaux propres</description>
        <code>110000</code>
        <childItems>
          <name>CapitalSocialOuPersonnel</name>
          <description>Capital social ou personnel</description>
          <code>111000</code>
          <childItems>
            <name>CapitalSocial</name>
            <description>Capital social</description>
            <code>111100</code>
          </childItems>
          <childItems>
            <name>FondsDeDotation</name>
            <description>Fonds de dotation</description>
            <code>111200</code>
          </childItems>
          <childItems>
            <name>CapitalPersonnel</name>
            <description>Capital personnel</description>
            <code>111700</code>
            <childItems>
              <name>CapitalIndividuel</name>
              <description>Capital individuel</description>
              <code>111710</code>
            </childItems>
            <childItems>
              <name>CompteDeLExploitant</name>
              <description>Compte de l'exploitant</description>
              <code>111750</code>
            </childItems>
          </childItems>
        </childItems>
      </childItems>
    </items>
    <items>
      <name>CLASSE_2</name>
      <description>CLASSE 2 : COMPTES D'ACTIF IMMOBILISE</description>
      <code>200000</code>
    </items>
    <items>
      <name>CLASSE_3</name>
      <description>CLASSE 3 : COMPTES D'ACTIF CIRCULANT</description>
      <code>300000</code>
      <childItems>
        <name>Stocks</name>
        <description>Stocks</description>
        <code>310000</code>
        <childItems>
          <name>Marchandises</name>
          <description>Marchandises</description>
          <code>311000</code>
          <childItems>
            <name>MarchandisesGroupeA</name>
            <description>Marchandises (groupe A)</description>
            <code>311100</code>
          </childItems>
          <childItems>
            <name>MarchandisesGroupeB</name>
            <description>Marchandises (groupe B)</description>
            <code>311200</code>
          </childItems>
        </childItems>
      </childItems>
      <childItems>
        <name>CreancesDeLActifCirculant</name>
        <description>Créances de l'actif circulant</description>
        <code>340000</code>
        <childItems>
          <name>EtatDebiteur</name>
          <description>Etat - débiteur</description>
          <code>345000</code>
          <childItems>
            <name>EtatTVARcupérable</name>
            <description>Etat - TVA récupérable</description>
            <code>345500</code>
            <childItems>
              <name>EtatTVARecupérableSurCharges</name>
              <description>Etat - TVA récupérable sur charges</description>
              <code>345520</code>
            </childItems>
          </childItems>
        </childItems>
      </childItems>
    </items>
    <items>
      <name>CLASSE_4</name>
      <description>CLASSE 4 : COMPTES DU PASSIF CIRCULANT</description>
      <code>400000</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>DettesDuPassifCirculant</name>
        <description>Dettes du passif circulant</description>
        <code>440000</code>
        <accountType>Passive</accountType>
        <childItems>
          <name>FournisseursEtComptesRattachés</name>
          <description>Fournisseurs et comptes rattachés</description>
          <code>441000</code>
          <accountType>Passive</accountType>
          <childItems>
            <name>Fournisseurs</name>
            <description>Fournisseurs</description>
            <code>441100</code>
            <accountType>Passive</accountType>
            <childItems>
              <name>FournisseursCategorieA</name>
              <description>Fournisseurs catégorie A</description>
              <code>441110</code>
              <accountType>Passive</accountType>
            </childItems>
            <childItems>
              <name>FournisseursCategorieB</name>
              <description>Fournisseurs catégorie B</description>
              <code>441120</code>
              <accountType>Passive</accountType>
            </childItems>
          </childItems>
        </childItems>
      </childItems>
    </items>
    <items>
      <name>CLASSE_5</name>
      <description>CLASSE 5 : COMPTES DE TRESORERIE</description>
      <code>500000</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>CLASSE_6</name>
      <description>CLASSE 6 : COMPTES DE CHARGES</description>
      <code>600000</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ChargesDExploitation</name>
        <description>Charges d'exploitation</description>
        <code>610000</code>
        <accountType>ActivePassive</accountType>
        <childItems>
          <name>AchatsRevendusDeMarchandises</name>
          <description>Achats revendus de marchandises</description>
          <code>611000</code>
          <accountType>ActivePassive</accountType>
          <childItems>
            <name>AchatsDeMarchandisesGroupeA</name>
            <description>Achats de marchandises &quot;groupe A&quot;</description>
            <code>611100</code>
            <accountType>ActivePassive</accountType>
          </childItems>
          <childItems>
            <name>AchatsDeMarchandisesGroupeB</name>
            <description>Achats de marchandises &quot;groupe B&quot;</description>
            <code>611200</code>
            <accountType>ActivePassive</accountType>
          </childItems>
          <childItems>
            <name>VariationDeStocksDeMarchandises</name>
            <description>Variation de stocks de marchandises</description>
            <code>611400</code>
            <accountType>ActivePassive</accountType>
          </childItems>
        </childItems>
      </childItems>
    </items>
    <items>
      <name>CLASSE_7</name>
      <description>CLASSE 7 : COMPTES DE PRODUITS</description>
      <code>700000</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>CLASSE_8</name>
      <description>CLASSE 8 : COMPTES DE RESULTATS</description>
      <code>800000</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>CLASSE_9</name>
      <description>CLASSE 9 : COMPTES DE PRODUITS ET CHARGES REFLECHIS</description>
      <code>900000</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <attributes>
    <name>ЗапретитьИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБыстрогоВыбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

src/cf/maERP_ib/src/ChartsOfCharacteristicTypes/ВидыСубконтоХозрасчетные/ВидыСубконтоХозрасчетные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконтоХозрасчетные</name>
  <type>
    <types>CatalogRef.ТоварныеГруппы</types>
    <types>CatalogRef.БанковскиеСчета</types>
    <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.СтавкиНДС</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.ДоговорыСКонтрагентами</types>
    <types>CatalogRef.МестаХранения</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.СтраныМира</types>
    <types>CatalogRef.НомераГТД</types>
    <types>DocumentRef.РасходныйКассовыйОрдер</types>
    <types>CatalogRef.Контрагенты</types>
    <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
    <types>DocumentRef.ПриходныйКассовыйОрдер</types>
    <types>String</types>
    <types>DocumentRef.РеализацияТоваровУслуг</types>
    <types>EnumRef.ТипыНоменклатуры</types>
    <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>DocumentRef.ЗаказПокупателя</types>
    <stringQualifiers>
      <length>10</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>СтатьиДвиженияДенежныхСредств</name>
      <description>Articles de flux de trésorerie</description>
      <code>00021</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>БанковскиеСчета</name>
      <description>Comptes bancaires</description>
      <code>00008</code>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </items>
    <items>
      <name>Договоры</name>
      <description>Contrats avec des contreparties</description>
      <code>00016</code>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Contreparties</description>
      <code>00005</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>СтатьиЗатрат</name>
      <description>Dépenses</description>
      <code>00007</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>ОбособленныеПодразделения</name>
      <description>Divisions</description>
      <code>00036</code>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </items>
    <items>
      <name>ДокументыОплаты</name>
      <description>Documents de paiement</description>
      <code>00063</code>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      </type>
    </items>
    <items>
      <name>ДокументыРасчетовСКонтрагентами</name>
      <description>Documents de règlements avec la contrepartie</description>
      <code>00039</code>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      </type>
    </items>
    <items>
      <name>ДокументыРеализации</name>
      <description>Documents de vente</description>
      <code>00046</code>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </items>
    <items>
      <name>МестаХранения</name>
      <description>Entrepôts</description>
      <code>00027</code>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </items>
    <items>
      <name>НоменклатурныеГруппы</name>
      <description>Groupes de produits</description>
      <code>00012</code>
      <type>
        <types>CatalogRef.ТоварныеГруппы</types>
      </type>
    </items>
    <items>
      <name>Партии</name>
      <description>Lots</description>
      <code>00038</code>
      <type>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Nomenclature</description>
      <code>00001</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>НомераГТД</name>
      <description>Numéros de déclaration en douane</description>
      <code>00050</code>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </items>
    <items>
      <name>СтраныПроисхождения</name>
      <description>Pays du monde</description>
      <code>00051</code>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </items>
    <items>
      <name>РаботникиОрганизаций</name>
      <description>Personnes physiques</description>
      <code>00003</code>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </items>
    <items>
      <name>СтавкиНДС</name>
      <description>Taux TVA</description>
      <code>00026</code>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

src/cf/maERP_ib/src/AccountingRegisters/Хозрасчетный/ManagerModule.bsl
Процедура СформироватьДвижения(ДокОбъект) Экспорт
	//ТЗТовары = ДокОбъект.Движения.ТоварыВНаличии.Выгрузить();
	//НЗДополнительныеРасходы = ДокОбъект.Движения.Найти("ДополнительныеРасходы");
	//Если Не НЗДополнительныеРасходы = Неопределено Тогда
	//	Для Каждого Стр из НЗДополнительныеРасходы Цикл
	//		НС = ТЗТовары.Добавить();
	//		ЗаполнитьЗначенияСвойств(НС,Стр);
	//	КонецЦикла;
	//КонецЕсли;
	//ТЗТовары.Свернуть("ВидДвижения,МестоХранения,Номенклатура","Количество,Сумма");
	//Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
	//	ДвижениеПоступлениеТоваров(ДокОбъект);
	//ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратПоставщику") Тогда
	//	ДвижениеКорректировкаВозвратПоступления(ДокОбъект,ТЗТовары);
	//ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг")
	//	Или ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратОтПокупателя") Тогда
	//	ДвижениеРеализацияТоваров(ДокОбъект,ТЗТовары); 
	//ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.СписаниеТоваров")
	//	Или ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ОприходованиеТоваров") Тогда
	//	ДвижениеСписаниеОприходованиеТоваров(ДокОбъект,ТЗТовары);
	//ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда 
	//	ДвижениеПеремещениеТоваров(ДокОбъект,ТЗТовары);
	//ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПересортицаТоваров") Тогда 
	//	ДвижениеПересортицаТоваров(ДокОбъект,ТЗТовары);
	//КонецЕсли;
КонецПроцедуры

Процедура ДвижениеПоступлениеТоваров(ДокОбъект) 
	Сч44111 = ПланыСчетов.Хозрасчетный.FournisseursCategorieA;
	Сч61110 = ПланыСчетов.Хозрасчетный.AchatsDeMarchandisesGroupeA;
	Сч34552 = ПланыСчетов.Хозрасчетный.EtatTVARecupérableSurCharges;
	Сч3111 = ПланыСчетов.Хозрасчетный.MarchandisesGroupeA; 
	Сч6114 = ПланыСчетов.Хозрасчетный.VariationDeStocksDeMarchandises;
	ДанныеСубконто = ОбщегоНазначенияПовтИсп.СтруктураДанныхСубконто();
	Для Каждого Стр Из ДокОбъект.ТЧТовары Цикл
		//с/с закупки
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация;
		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
		НС.СчетДт = Сч61110;
		НС.СубконтоДт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоДт.МестаХранения = ДокОбъект.МестоХранения;
		НС.КоличествоДт = Стр.Количество;
		НС.СчетКт = Сч44111;
		НС.СубконтоКт.Контрагенты = ДокОбъект.Контрагент;
		НС.СубконтоКт.ДокументыРасчетовСКонтрагентами = ДокОбъект.Ссылка;
		НС.Сумма = Стр.Сумма;
		//НДС
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация;
		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
		НС.СчетДт = Сч34552;
		НС.СубконтоДт.СтавкиНДС = Стр.СтавкаНДС;
		НС.СубконтоДт.НоменклатурныеГруппы = Стр.Номенклатура.ТоварнаяГруппа;
		НС.СчетКт = Сч44111;
		НС.СубконтоКт.Контрагенты = ДокОбъект.Контрагент;
		НС.СубконтоКт.ДокументыРасчетовСКонтрагентами = ДокОбъект.Ссылка;
		НС.Сумма = Стр.СуммаНДС;
		//склад
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация;
		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
		НС.СчетДт = Сч3111;
		НС.СубконтоДт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоДт.МестаХранения = ДокОбъект.МестоХранения;
		НС.КоличествоДт = Стр.Количество;
		НС.СчетКт = Сч6114;
		НС.СубконтоКт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоКт.МестаХранения = ДокОбъект.МестоХранения;
		НС.КоличествоКт = Стр.Количество;
		НС.Сумма = Стр.Сумма;
	КонецЦикла;
	//Для Каждого СтрДопРасход Из ДокОбъект.ТЧДополнительныеРасходы Цикл	
	//	// Получаем основу распределения
	//	Если ЗначениеЗаполнено(СтрДопРасход.Номенклатура) Тогда
	//		МасТовары = ДокОбъект.ТЧТовары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", СтрДопРасход.Номенклатура, СтрДопРасход.Характеристика));
	//		СуммаТоваров = 0;
	//		Для Каждого Стр Из МасТовары Цикл
	//			СуммаТоваров = СуммаТоваров + Стр.Сумма;	
	//		КонецЦикла;	
	//	Иначе
	//		МасТовары = ДокОбъект.ТЧТовары;
	//		СуммаТоваров = ДокОбъект.ТЧТовары.Итог("Сумма");
	//	КонецЕсли;
	//	// Распределяем
	//	СуммаКРаспределению = СтрДопРасход.Сумма;
	//	КоличествоТоваров = МасТовары.Количество(); 
	//	Для А = 1 По КоличествоТоваров Цикл
	//		Стр = МасТовары[А - 1];
	//		СуммаНаТовар = ?(А = КоличествоТоваров, СуммаКРаспределению, Окр(СтрДопРасход.Сумма / СуммаТоваров * Стр.Сумма, 2));
	//		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
	//		НС.Период = ДокОбъект.Дата;
	//		НС.Организация = ДокОбъект.Организация;
	//		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
	//		НС.СчетДт = Сч41_1;
	//		НС.СубконтоДт.Номенклатура = Стр.Номенклатура;
	//		НС.СубконтоДт.МестаХранения = ДокОбъект.МестоХранения;
	//		НС.СчетКт = Сч60_1;
	//		НС.СубконтоКт.Контрагенты = СтрДопРасход.Контрагент;
	//		НС.СубконтоКт.Договоры = СтрДопРасход.Договор;
	//		НС.Сумма = СуммаНаТовар;
	//		СуммаКРаспределению = СуммаКРаспределению - СуммаНаТовар; 
	//	КонецЦикла;
	//КонецЦикла;	
	
	////НДС не формируем
	//ТЗНдс = ДокОбъект.ТЧТовары.Выгрузить();
	//ТЗНдс.Свернуть(,"СуммаНДС");
	//Для Каждого Стр из ТЗНдс Цикл 
	//	НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
	//	НС.Период = ДокОбъект.Дата;
	//	НС.Организация = ДокОбъект.Организация;
	//	НС.СчетДт = Сч19_03;
	//	НС.СубконтоДт.Контрагенты = ДокОбъект.Контрагент;
	//	НС.СубконтоДт.СФПолученные = ДокОбъект.Ссылка;
	//	НС.СчетКт = Сч60_1;
	//	НС.СубконтоКт.Контрагенты = ДокОбъект.Контрагент;
	//	НС.СубконтоКт.Договоры = ДокОбъект.Договор;
	//	НС.Сумма = Стр.СуммаНДС;
	//КонецЦикла;
КонецПроцедуры

Процедура ДвижениеКорректировкаВозвратПоступления(ДокОбъект,ТЗТовары) 
	Сч41_1 = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
	Сч60_1 = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
	Сч19_03 = ПланыСчетов.Хозрасчетный.НДСпоПриобретеннымМПЗ; 
	Сч76_02 = ПланыСчетов.Хозрасчетный.РасчетыПоПретензиям; 
	Сч91_01 = ПланыСчетов.Хозрасчетный.ПрочиеДоходы; 
	Сч91_02 = ПланыСчетов.Хозрасчетный.ПрочиеРасходы; 
	Для Каждого Стр Из ТЗТовары Цикл
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация;
		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
		Приход = Стр.ВидДвижения = ВидДвиженияНакопления.Приход;
		Сумма = Стр.Сумма;
		НС.СчетДт = Сч76_02;
		НС.СубконтоДт.Контрагенты = ДокОбъект.Контрагент;
		НС.СубконтоДт.Договоры = ДокОбъект.Договор;
		НС.СчетКт = Сч41_1;
		НС.СубконтоКт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоКт.МестаХранения = ДокОбъект.МестоХранения;
		НС.КоличествоКт = Стр.Количество;
		НС.Сумма = Сумма;
	КонецЦикла;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратПоставщику") Тогда
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация;
		НС.СчетДт = Сч60_1;
		НС.СубконтоДт.Контрагенты = ДокОбъект.Контрагент;
		НС.СубконтоДт.Договоры = ДокОбъект.Договор;
		НС.СчетКт = Сч76_02;
		НС.СубконтоКт.Контрагенты = ДокОбъект.Контрагент;
		НС.СубконтоКт.Договоры = ДокОбъект.Договор;
		НС.Сумма = ДокОбъект.Сумма;
		
		СуммаДохода = ДокОбъект.Сумма - ТЗТовары.Итог("Сумма");
		Если СуммаДохода>0 Тогда 
			НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
			НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
			НС.Период = ДокОбъект.Дата;
			НС.Организация = ДокОбъект.Организация;
			НС.СчетДт = Сч76_02;
			НС.СубконтоДт.Контрагенты = ДокОбъект.Контрагент;
			НС.СубконтоДт.Договоры = ДокОбъект.Договор;
			НС.СчетКт = Сч91_01;
			НС.Сумма = СуммаДохода;
		Иначе
			НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
			НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
			НС.Период = ДокОбъект.Дата;
			НС.Организация = ДокОбъект.Организация;
			НС.СчетДт = Сч91_02;
			НС.СчетКт = Сч76_02;
			НС.СубконтоКт.Контрагенты = ДокОбъект.Контрагент;
			НС.СубконтоКт.Договоры = ДокОбъект.Договор;
			НС.Сумма = -СуммаДохода;
		КонецЕсли;
	КонецЕсли;
	////НДС не формируем
	//Если ДокОбъект.ДополнительныеСвойства.Свойство("ТЗТоварыССериями") Тогда
	//	ТЗНдс = ДокОбъект.ДополнительныеСвойства.ТЗТоварыССериями.Скопировать();
	//Иначе
	//	ТЗНдс = ДокОбъект.ТЧТовары.Выгрузить();
	//КонецЕсли;
	//ТЗНдс.Свернуть(,"СуммаНДС");
	//Для Каждого Стр из ТЗНдс Цикл 
	//	НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
	//	НС.Период = ДокОбъект.Дата;
	//	НС.Организация = ДокОбъект.Организация;
	//	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.КорректировкаПоступления") Тогда
	//		НС.СчетДт = Сч19_03;
	//		НС.СубконтоДт.Контрагенты = ДокОбъект.Контрагент;
	//		НС.СубконтоДт.СФПолученные = ДокОбъект.Ссылка;
	//		НС.СчетКт = Сч60_1;
	//		НС.СубконтоКт.Контрагенты = ДокОбъект.Контрагент;
	//		НС.СубконтоКт.Договоры = ДокОбъект.Договор;
	//	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратПоставщику") Тогда
	//		НС.СчетДт = Сч60_1;
	//		НС.СубконтоДт.Контрагенты = ДокОбъект.Контрагент;
	//		НС.СубконтоДт.Договоры = ДокОбъект.Договор;
	//		НС.СчетКт = Сч19_03;
	//		НС.СубконтоКт.Контрагенты = ДокОбъект.Контрагент;
	//		НС.СубконтоКт.СФПолученные = ДокОбъект.Ссылка;
	//	КонецЕсли;
	//	НС.Сумма = ?(ЭтоКорректировка,-Стр.СуммаНДС,Стр.СуммаНДС);
	//КонецЦикла;
КонецПроцедуры

Процедура ДвижениеРеализацияТоваров(ДокОбъект,ТЗТовары) 
	Сч41_1 = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
	Сч62_1 = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	Сч90_02_1 = ПланыСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД;
	Сч90_01_1 = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД;
	Сч90_3 = ПланыСчетов.Хозрасчетный.Продажи_НДС;
	Сч68_02 = ПланыСчетов.Хозрасчетный.НДС;
	ЭтоКорректировка = Не ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг");
	ТЗТовары.Свернуть("ВидДвижения,МестоХранения,Номенклатура","Количество,Сумма");
	Для Каждого Стр Из ТЗТовары Цикл
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация; 
		Приход = Стр.ВидДвижения = ВидДвиженияНакопления.Приход;
		НС.СчетДт = Сч90_02_1;
		НС.СубконтоДт.НоменклатурныеГруппы = Стр.Номенклатура.ТоварнаяГруппа;
		НС.СчетКт = Сч41_1;                                            
		НС.СубконтоКт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоКт.МестаХранения = ДокОбъект.МестоХранения;
		НС.КоличествоКт = ?(Приход,-Стр.Количество,Стр.Количество);
		НС.Сумма = ?(Приход,-Стр.Сумма,Стр.Сумма);
	КонецЦикла; 
	Если ДокОбъект.ДополнительныеСвойства.Свойство("ТЗТоварыССериями") Тогда
		ТЗТоварыССериями = ДокОбъект.ДополнительныеСвойства.ТЗТоварыССериями.Скопировать();
	Иначе
		ТЗТоварыССериями = ДокОбъект.ТЧТовары.Выгрузить();
	КонецЕсли;
	Для Каждого Стр из ТЗТоварыССериями Цикл 
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация; 
		НС.СчетДт = Сч62_1;
		НС.СубконтоДт.Контрагенты = ДокОбъект.Контрагент;
		НС.СубконтоДт.Договоры = ДокОбъект.Договор;
		НС.СчетКт = Сч90_01_1;
		НС.СубконтоКт.НоменклатурныеГруппы = Стр.Номенклатура.ТоварнаяГруппа;
		НС.СубконтоКт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоКт.СтавкиНДС = Стр.СтавкаНДС;
		НС.КоличествоКт = ?(ЭтоКорректировка,-Стр.Количество,Стр.Количество);
		НС.Сумма = ?(ЭтоКорректировка,-Стр.СуммаСНДС,Стр.СуммаСНДС);
	КонецЦикла;
	
	////НДС не формируем
	//ТЗНдс = ДокОбъект.ТЧТовары.Выгрузить();
	//ТЗНдс.Свернуть("Номенклатура,СтавкаНДС","СуммаНДС");
	//Если ЭтоКорректировка Тогда
	//	ТЗНдс.очистить();
	//	Для Каждого Стр из ДокОбъект.ТЧТовары Цикл
	//		Если Стр.СтавкаНДС = Стр.СтавкаНДСДоКорректировки 
	//			И Стр.СуммаНДС = Стр.СуммаНДСДоКорректировки Тогда 
	//			Продолжить;
	//		КонецЕсли;
	//		Если Стр.СтавкаНДС = Стр.СтавкаНДСДоКорректировки Тогда 
	//			НС = ТЗНдс.Добавить(); 
	//			НС.СтавкаНДС = Стр.СтавкаНДС;
	//			НС.СуммаНДС = Стр.СуммаНДСДоКорректировки - Стр.СуммаНДС;
	//		Иначе
	//			НС = ТЗНдс.Добавить(); 
	//			НС.СтавкаНДС = Стр.СтавкаНДСДоКорректировки;
	//			НС.СуммаНДС = -Стр.СуммаНДСДоКорректировки;
	//			НС = ТЗНдс.Добавить(); 
	//			НС.СтавкаНДС = Стр.СтавкаНДС;
	//			НС.СуммаНДС = Стр.СуммаНДС;
	//		КонецЕсли;
	//	КонецЦикла;
	//	ТЗНдс.Свернуть("Номенклатура,СтавкаНДС","СуммаНДС");
	//КонецЕсли;
	//ТЗНдс.Колонки.Добавить("ТоварнаяГруппа");
	//Для Каждого Стр из ТЗНдс Цикл
	//	Стр.ТоварнаяГруппа = Стр.Номенклатура.ТоварнаяГруппа;
	//КонецЦикла;
	//ТЗНдс.Свернуть("ТоварнаяГруппа,СтавкаНДС","СуммаНДС");
	//Для Каждого Стр из ТЗНдс Цикл 
	//	НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
	//	НС.Период = ДокОбъект.Дата;
	//	НС.Организация = ДокОбъект.Организация;
	//	НС.СчетДт = Сч90_3;
	//	НС.СубконтоДт.НоменклатурныеГруппы = Стр.ТоварнаяГруппа;
	//	НС.СубконтоДт.СтавкиНДС = Стр.СтавкаНДС;
	//	НС.СчетКт = Сч68_02;
	//	НС.Сумма = ?(ЭтоКорректировка,-Стр.СуммаНДС,Стр.СуммаНДС);
	//КонецЦикла;
КонецПроцедуры

Процедура ДвижениеСписаниеОприходованиеТоваров(ДокОбъект,ТЗТовары)
	Сч41_1 = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
	Сч91_01 = ПланыСчетов.Хозрасчетный.ПрочиеДоходы;
	Сч94 = ПланыСчетов.Хозрасчетный.НедостачиИПотериОтПорчиЦенностей;
	Для Каждого Стр Из ТЗТовары Цикл
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация; 
		Если Стр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда 
			НС.СчетДт = Сч41_1;
			НС.СубконтоДт.Номенклатура = Стр.Номенклатура;
			НС.СубконтоДт.МестаХранения = Стр.МестоХранения;
			НС.КоличествоДт = Стр.Количество;
			НС.СчетКт = Сч91_01;
		Иначе 
			НС.СчетДт = Сч94;
			НС.СчетКт = Сч41_1;
			НС.СубконтоКт.Номенклатура = Стр.Номенклатура;
			НС.СубконтоКт.МестаХранения = Стр.МестоХранения;
			НС.КоличествоКт = Стр.Количество;
		КонецЕсли;
		НС.Сумма = Стр.Сумма;
	КонецЦикла;
КонецПроцедуры

Процедура ДвижениеПеремещениеТоваров(ДокОбъект,ТЗТовары)
	Сч41_1 = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
	Мас = ТЗТовары.НайтиСтроки(Новый Структура("ВидДвижения",ВидДвиженияНакопления.Расход));
	Для Каждого Стр Из Мас Цикл
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Содержание = "Перемещение товаров";
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация; 
		НС.СчетДт = Сч41_1;
		НС.СубконтоДт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоДт.МестаХранения = ДокОбъект.МестоХранения;
		НС.КоличествоДт = Стр.Количество;
		НС.СчетКт = Сч41_1;
		НС.СубконтоКт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоКт.МестаХранения = ДокОбъект.МестоХраненияОприходование;
		НС.КоличествоКт = Стр.Количество;
		НС.Сумма = Стр.Сумма;
	КонецЦикла;
КонецПроцедуры

Процедура ДвижениеВыпускПродукции(ДокОбъект,ТЗТовары)
	Сч41_1 = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
	Сч20 = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
	Для Каждого Стр Из ТЗТовары Цикл
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация;
		Если Стр.ВидДвижения = ВидДвиженияНакопления.Расход Тогда 
			НС.Содержание = "Отпуск материалов в производство";
			НС.СчетДт = Сч20;
			НС.СчетКт = Сч41_1;
			НС.СубконтоКт.Номенклатура = Стр.Номенклатура;
			НС.СубконтоКт.МестаХранения = ДокОбъект.МестоХранения;
			НС.КоличествоКт = Стр.Количество;
		Иначе
			НС.Содержание = "Выпуск продукции";
			НС.СчетДт = Сч41_1;
			НС.СубконтоДт.Номенклатура = Стр.Номенклатура;
			НС.СубконтоДт.МестаХранения = ДокОбъект.МестоХраненияОприходование;
			НС.КоличествоДт = Стр.Количество;
			НС.СчетКт = Сч20;
		КонецЕсли;
		НС.Сумма = Стр.Сумма;
	КонецЦикла;
КонецПроцедуры

Процедура ДвижениеАктРазбора(ДокОбъект,ТЗТовары)
	Сч41_1 = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
	ТЗПриход = ТЗТовары.Скопировать(Новый Структура("ВидДвижения",ВидДвиженияНакопления.Приход));
	Для Каждого Стр Из ТЗПриход Цикл
		НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
		НС.Период = ДокОбъект.Дата;
		НС.Организация = ДокОбъект.Организация;
		НС.Содержание = "Акт разбора";
		НС.СчетДт = Сч41_1;
		НС.СубконтоДт.Номенклатура = Стр.Номенклатура;
		НС.СубконтоДт.МестаХранения = ДокОбъект.МестоХранения;
		НС.КоличествоДт = Стр.Количество;
		НС.СчетКт = Сч41_1;
		НС.СубконтоКт.Номенклатура = ДокОбъект.Номенклатура;
		НС.СубконтоКт.МестаХранения = ДокОбъект.МестоХранения;
		НС.КоличествоКт = ?(ТЗПриход.Индекс(Стр) = 0, Стр.Количество, 0);
		НС.Сумма = Стр.Сумма;
	КонецЦикла;
КонецПроцедуры

Процедура ДвижениеПересортицаТоваров(ДокОбъект,ТЗТовары)
	//Сч41_1 = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
	//ТЗПриход = ТЗТовары.Скопировать(Новый Структура("ВидДвижения",ВидДвиженияНакопления.Приход));
	//Для Каждого Стр Из ТЗПриход Цикл
	//	НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
	//	НС.Период = ДокОбъект.Дата;
	//	НС.Организация = ДокОбъект.Организация;
	//	НС.Содержание = "Акт разбора";
	//	НС.СчетДт = Сч41_1;
	//	НС.ПодразделениеДт = ДокОбъект.Подразделение;
	//	НС.СубконтоДт.Номенклатура = Стр.Номенклатура;
	//	НС.СубконтоДт.МестаХранения = ДокОбъект.МестоХранения;
	//	НС.КоличествоДт = Стр.Количество;
	//	НС.СчетКт = Сч41_1;
	//	НС.ПодразделениеКт = ДокОбъект.Подразделение;
	//	НС.СубконтоКт.Номенклатура = ДокОбъект.Номенклатура;
	//	НС.СубконтоКт.МестаХранения = ДокОбъект.МестоХранения;
	//	НС.КоличествоКт = ?(ТЗПриход.Индекс(Стр) = 0, Стр.Количество, 0);
	//	НС.Сумма = Стр.Сумма;
	//КонецЦикла;
КонецПроцедуры

Функция ДобавитьДвижение(ДокОбъект, СчётДт, СчётКт, Количество, Сумма, Валюта, ДанныеСубконто)
	НС = ДокОбъект.Движения.Хозрасчетный.Добавить();
	НС.Период = ДокОбъект.Дата;
	НС.Организация = ДокОбъект.Организация;
	НС.СчетДт = СчётДт;
	НС.СчетКт = СчётКт;
	Если Количество > 0 и НС.СчетДт.Количественный Тогда
		НС.КоличествоДт = Количество;	
	КонецЕсли;
	Если Количество > 0 и НС.СчетКт.Количественный Тогда
		НС.КоличествоКт = Количество;	
	КонецЕсли;
	Если СчётДт.Валютный Тогда
		НС.ВалютнаяСуммаДт = Сумма;
		НС.ВалютаДт = Валюта;
	КонецЕсли;
	Если СчётКт.Валютный Тогда
		НС.ВалютнаяСуммаКт = Сумма;
		НС.ВалютаКт = Валюта;
	КонецЕсли;
	НС.Сумма = Сумма;
	НС.Содержание = ДокОбъект.Метаданные().ПредставлениеОбъекта;
	// Заполняем субконто
	ПВХ = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные;
	// Дт
	Для Каждого Стр Из НС.СчетДт.ВидыСубконто Цикл
		ИмяСубконто = Стр.ВидСубконто.ИмяПредопределенныхДанных;
        НС.СубконтоДт.Вставить(Стр.ВидСубконто, ДанныеСубконто[ИмяСубконто]);
	КонецЦикла;
	// Кт
	Для Каждого Стр Из НС.СчетКт.ВидыСубконто Цикл
		ИмяСубконто = Стр.ВидСубконто.ИмяПредопределенныхДанных;
        НС.СубконтоКт.Вставить(Стр.ВидСубконто, ДанныеСубконто[ИмяСубконто]);
	КонецЦикла;
	Возврат НС;	
КонецФункции
